## Staging: dns
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ses_receipt_rule.ses_receiving_emails_inbound-to-lambda-arn will be created
  + resource "aws_ses_receipt_rule" "ses_receiving_emails_inbound-to-lambda-arn" {
      + arn           = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + name          = "ses_receiving_emails_inbound-to-lambda"
      + recipients    = [
          + "staging.notification.cdssandbox.xyz",
        ]
      + rule_set_name = "main"
      + scan_enabled  = true
      + tls_policy    = (known after apply)

      + lambda_action {
          + function_arn    = "arn:aws:lambda:us-east-1:239043911459:function:ses_receiving_emails"
          + invocation_type = "Event"
          + position        = 1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
